create_clock -period 100.000 -name clk -waveform {0.000 50.000} [get_ports clk]
create_generated_clock -name {STA[0].U/full_bus_0} -source [get_ports clk] -divide_by 1 [get_pins {STA[0].U/current_full_reg/Q}]
create_generated_clock -name {STA[1].U/full_bus_1} -source [get_ports clk] -divide_by 1 [get_pins {STA[1].U/current_full_reg/Q}]
create_generated_clock -name {STA[2].U/full_bus_2} -source [get_ports clk] -divide_by 1 [get_pins {STA[2].U/current_full_reg/Q}]
create_generated_clock -name {STA[3].U/full_bus_3} -source [get_ports clk] -divide_by 1 [get_pins {STA[3].U/current_full_reg/Q}]
create_generated_clock -name {STA[4].U/full_bus_4} -source [get_ports clk] -divide_by 1 [get_pins {STA[4].U/current_full_reg/Q}]
create_generated_clock -name {STA[5].U/full_bus_5} -source [get_ports clk] -divide_by 1 [get_pins {STA[5].U/current_full_reg/Q}]
create_generated_clock -name {STA[6].U/full_bus_6} -source [get_ports clk] -divide_by 1 [get_pins {STA[6].U/current_full_reg/Q}]
create_generated_clock -name {STA[7].U/full_bus_7} -source [get_ports clk] -divide_by 1 [get_pins {STA[7].U/current_full_reg/Q}]
set_input_delay -clock [get_clocks clk] -clock_fall -min -add_delay 4.000 [get_ports {data_in[*]}]
set_input_delay -clock [get_clocks clk] -clock_fall -max -add_delay 4.000 [get_ports {data_in[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 4.000 [get_ports {data_in[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 4.000 [get_ports {data_in[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 4.000 [get_ports res_n]
set_input_delay -clock [get_clocks clk] -max -add_delay 4.000 [get_ports res_n]
set_input_delay -clock [get_clocks clk] -min -add_delay 4.000 [get_ports shift_in]
set_input_delay -clock [get_clocks clk] -max -add_delay 4.000 [get_ports shift_in]
set_input_delay -clock [get_clocks clk] -min -add_delay 4.000 [get_ports shift_out]
set_input_delay -clock [get_clocks clk] -max -add_delay 4.000 [get_ports shift_out]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {data_out[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 4.000 [get_ports {data_out[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports empty]
set_output_delay -clock [get_clocks clk] -max -add_delay 4.000 [get_ports empty]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports full]
set_output_delay -clock [get_clocks clk] -max -add_delay 4.000 [get_ports full]
